; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

    (:action dead-end-stack
  	     :parameters (?x - block ?y - block)
  	     :precondition (and (holding ?x) (clear ?y))
  	     :effect
  	     (and (not (holding ?x))
  		   (not (clear ?y))
  		   (clear ?x)
  		   ;; REMOVED: (handempty)
  		   (on ?x ?y)
  		 ))

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem blocks-25-0)
(:domain blocks)
(:objects
    DUMMY1
    DUMMY2
    DUMMY3
    Y
    X
    W
    V
    U
    T
    S
    R
    Q
    P
    O
    N
    M
    L
    K
    J
    I
    H
    G
    F
    E
    D
    C
    A
    B
 - block)
(:init
    (CLEAR A)
    (CLEAR U)
    (CLEAR X)
    (CLEAR P)
    (ONTABLE B)
    (ONTABLE F)
    (ONTABLE E)
    (ONTABLE P)
    (ON A V)
    (ON V C)
    (ON C R)
    (ON R S)
    (ON S H)
    (ON H O)
    (ON O D)
    (ON D W)
    (ON W Y)
    (ON Y G)
    (ON G J)
    (ON J Q)
    (ON Q M)
    (ON M B)
    (ON U I)
    (ON I K)
    (ON K T)
    (ON T F)
    (ON X N)
    (ON N L)
    (ON L E)
    (HANDEMPTY)
)
(:goal (and
    (ON L T)
    (ON T W)
    (ON W N)
    (ON N O)
    (ON O S)
    (ON S Y)
    (ON Y A)
    (ON A R)
    (ON R C)
    (ON C G)
    (ON G J)
    (ON J D)
    (ON D B)
    (ON B K)
    (ON K P)
    (ON P M)
    (ON M X)
    (ON X E)
    (ON E V)
    (ON V F)
    (ON F I)
    (ON I Q)
    (ON Q H)
    (ON H U)
)
)
)

; plan
1. (unstack a v)
   deleted: (clear a) (handempty) (on a v)
   added: (holding a) (clear v)
   goals met: 1 of 24
2. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 1 of 24
3. (unstack x n)
   deleted: (clear x) (handempty) (on x n)
   added: (holding x) (clear n)
   goals met: 1 of 24
4. (put-down x)
   deleted: (holding x)
   added: (clear x) (handempty) (ontable x)
   goals met: 1 of 24
5. (unstack v c)
   deleted: (clear v) (handempty) (on v c)
   added: (holding v) (clear c)
   goals met: 1 of 24
6. (put-down v)
   deleted: (holding v)
   added: (clear v) (handempty) (ontable v)
   goals met: 1 of 24
7. (unstack n l)
   deleted: (clear n) (handempty) (on n l)
   added: (holding n) (clear l)
   goals met: 1 of 24
8. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 1 of 24
9. (unstack l e)
   deleted: (clear l) (handempty) (on l e)
   added: (holding l) (clear e)
   goals met: 1 of 24
10. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 1 of 24
11. (unstack c r)
   deleted: (clear c) (handempty) (on c r)
   added: (holding c) (clear r)
   goals met: 1 of 24
12. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 1 of 24
13. (unstack r s)
   deleted: (clear r) (handempty) (on r s)
   added: (holding r) (clear s)
   goals met: 1 of 24
14. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 1 of 24
15. (unstack s h)
   deleted: (clear s) (handempty) (on s h)
   added: (holding s) (clear h)
   goals met: 1 of 24
16. (put-down s)
   deleted: (holding s)
   added: (clear s) (handempty) (ontable s)
   goals met: 1 of 24
17. (unstack h o)
   deleted: (clear h) (handempty) (on h o)
   added: (holding h) (clear o)
   goals met: 1 of 24
18. (put-down h)
   deleted: (holding h)
   added: (clear h) (handempty) (ontable h)
   goals met: 1 of 24
19. (unstack o d)
   deleted: (clear o) (handempty) (on o d)
   added: (holding o) (clear d)
   goals met: 1 of 24
20. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 1 of 24
21. (unstack d w)
   deleted: (clear d) (handempty) (on d w)
   added: (holding d) (clear w)
   goals met: 1 of 24
22. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 1 of 24
23. (unstack w y)
   deleted: (clear w) (handempty) (on w y)
   added: (holding w) (clear y)
   goals met: 1 of 24
24. (put-down w)
   deleted: (holding w)
   added: (clear w) (handempty) (ontable w)
   goals met: 1 of 24
25. (unstack y g)
   deleted: (clear y) (handempty) (on y g)
   added: (holding y) (clear g)
   goals met: 1 of 24
26. (put-down y)
   deleted: (holding y)
   added: (clear y) (handempty) (ontable y)
   goals met: 1 of 24
27. (unstack u i)
   deleted: (clear u) (handempty) (on u i)
   added: (holding u) (clear i)
   goals met: 1 of 24
28. (put-down u)
   deleted: (holding u)
   added: (clear u) (handempty) (ontable u)
   goals met: 1 of 24
29. (unstack i k)
   deleted: (clear i) (handempty) (on i k)
   added: (holding i) (clear k)
   goals met: 1 of 24
30. (put-down i)
   deleted: (holding i)
   added: (clear i) (handempty) (ontable i)
   goals met: 1 of 24
31. (unstack k t)
   deleted: (clear k) (handempty) (on k t)
   added: (holding k) (clear t)
   goals met: 1 of 24
32. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 1 of 24
33. (unstack t f)
   deleted: (clear t) (handempty) (on t f)
   added: (holding t) (clear f)
   goals met: 1 of 24
34. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 1 of 24
35. (unstack g j)
   deleted: (clear g) (handempty) (on g j)
   added: (holding g) (clear j)
   goals met: 0 of 24
36. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 0 of 24
37. (unstack j q)
   deleted: (clear j) (handempty) (on j q)
   added: (holding j) (clear q)
   goals met: 0 of 24
38. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 0 of 24
39. (unstack q m)
   deleted: (clear q) (handempty) (on q m)
   added: (holding q) (clear m)
   goals met: 0 of 24
40. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 0 of 24
41. (unstack m b)
   deleted: (clear m) (handempty) (on m b)
   added: (holding m) (clear b)
   goals met: 0 of 24
42. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 0 of 24
43. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 0 of 24
44. (stack j d)
   deleted: (holding j) (clear d)
   added: (clear j) (handempty) (on j d)
   goals met: 1 of 24
45. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 1 of 24
46. (stack l t)
   deleted: (holding l) (clear t)
   added: (clear l) (handempty) (on l t)
   goals met: 2 of 24
47. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 2 of 24
48. (stack q h)
   deleted: (holding q) (clear h)
   added: (clear q) (handempty) (on q h)
   goals met: 3 of 24
49. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 3 of 24
50. (stack r c)
   deleted: (holding r) (clear c)
   added: (clear r) (handempty) (on r c)
   goals met: 4 of 24
51. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 4 of 24
52. (stack f i)
   deleted: (holding f) (clear i)
   added: (clear f) (handempty) (on f i)
   goals met: 5 of 24
53. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 5 of 24
54. (stack k p)
   deleted: (holding k) (clear p)
   added: (clear k) (handempty) (on k p)
   goals met: 6 of 24
55. (pick-up y)
   deleted: (ontable y) (clear y) (handempty)
   added: (holding y)
   goals met: 6 of 24
56. (stack y a)
   deleted: (holding y) (clear a)
   added: (clear y) (handempty) (on y a)
   goals met: 7 of 24
57. (pick-up v)
   deleted: (ontable v) (clear v) (handempty)
   added: (holding v)
   goals met: 7 of 24
58. (stack v f)
   deleted: (holding v) (clear f)
   added: (clear v) (handempty) (on v f)
   goals met: 8 of 24
59. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 8 of 24
60. (stack m x)
   deleted: (holding m) (clear x)
   added: (clear m) (handempty) (on m x)
   goals met: 9 of 24
61. (pick-up s)
   deleted: (ontable s) (clear s) (handempty)
   added: (holding s)
   goals met: 9 of 24
62. (stack s y)
   deleted: (holding s) (clear y)
   added: (clear s) (handempty) (on s y)
   goals met: 10 of 24
63. (pick-up w)
   deleted: (ontable w) (clear w) (handempty)
   added: (holding w)
   goals met: 10 of 24
64. (stack w n)
   deleted: (holding w) (clear n)
   added: (clear w) (handempty) (on w n)
   goals met: 11 of 24
65. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 11 of 24
66. (stack o s)
   deleted: (holding o) (clear s)
   added: (clear o) (handempty) (on o s)
   goals met: 12 of 24
67. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 12 of 24
68. (stack b k)
   deleted: (holding b) (clear k)
   added: (clear b) (handempty) (on b k)
   goals met: 13 of 24
69. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 13 of 24
70. (stack e v)
   deleted: (holding e) (clear v)
   added: (clear e) (handempty) (on e v)
   goals met: 14 of 24
71. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 14 of 24
72. (stack g j)
   deleted: (holding g) (clear j)
   added: (clear g) (handempty) (on g j)
   goals met: 15 of 24
73. (unstack b k)
   deleted: (clear b) (handempty) (on b k)
   added: (holding b) (clear k)
   goals met: 14 of 24
74. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 14 of 24
75. (unstack k p)
   deleted: (clear k) (handempty) (on k p)
   added: (holding k) (clear p)
   goals met: 13 of 24
76. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 13 of 24
77. (pick-up p)
   deleted: (ontable p) (clear p) (handempty)
   added: (holding p)
   goals met: 13 of 24
78. (stack p m)
   deleted: (holding p) (clear m)
   added: (clear p) (handempty) (on p m)
   goals met: 14 of 24
79. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 14 of 24
80. (stack k p)
   deleted: (holding k) (clear p)
   added: (clear k) (handempty) (on k p)
   goals met: 15 of 24
81. (unstack l t)
   deleted: (clear l) (handempty) (on l t)
   added: (holding l) (clear t)
   goals met: 14 of 24
82. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 14 of 24
83. (pick-up t)
   deleted: (ontable t) (clear t) (handempty)
   added: (holding t)
   goals met: 14 of 24
84. (stack t w)
   deleted: (holding t) (clear w)
   added: (clear t) (handempty) (on t w)
   goals met: 15 of 24
85. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 15 of 24
86. (stack l t)
   deleted: (holding l) (clear t)
   added: (clear l) (handempty) (on l t)
   goals met: 16 of 24
87. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 16 of 24
88. (stack b k)
   deleted: (holding b) (clear k)
   added: (clear b) (handempty) (on b k)
   goals met: 17 of 24
89. (unstack r c)
   deleted: (clear r) (handempty) (on r c)
   added: (holding r) (clear c)
   goals met: 16 of 24
90. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 16 of 24
91. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 16 of 24
92. (stack c g)
   deleted: (holding c) (clear g)
   added: (clear c) (handempty) (on c g)
   goals met: 17 of 24
93. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 17 of 24
94. (stack r c)
   deleted: (holding r) (clear c)
   added: (clear r) (handempty) (on r c)
   goals met: 18 of 24
95. (unstack q h)
   deleted: (clear q) (handempty) (on q h)
   added: (holding q) (clear h)
   goals met: 17 of 24
96. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 17 of 24
97. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 17 of 24
98. (stack h u)
   deleted: (holding h) (clear u)
   added: (clear h) (handempty) (on h u)
   goals met: 18 of 24
99. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 18 of 24
100. (stack q h)
   deleted: (holding q) (clear h)
   added: (clear q) (handempty) (on q h)
   goals met: 19 of 24
101. (unstack l t)
   deleted: (clear l) (handempty) (on l t)
   added: (holding l) (clear t)
   goals met: 18 of 24
102. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 18 of 24
103. (unstack t w)
   deleted: (clear t) (handempty) (on t w)
   added: (holding t) (clear w)
   goals met: 17 of 24
104. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 17 of 24
105. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 17 of 24
106. (stack l t)
   deleted: (holding l) (clear t)
   added: (clear l) (handempty) (on l t)
   goals met: 18 of 24
107. (unstack w n)
   deleted: (clear w) (handempty) (on w n)
   added: (holding w) (clear n)
   goals met: 17 of 24
108. (put-down w)
   deleted: (holding w)
   added: (clear w) (handempty) (ontable w)
   goals met: 17 of 24
109. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 17 of 24
110. (stack n o)
   deleted: (holding n) (clear o)
   added: (clear n) (handempty) (on n o)
   goals met: 18 of 24
111. (pick-up w)
   deleted: (ontable w) (clear w) (handempty)
   added: (holding w)
   goals met: 18 of 24
112. (stack w n)
   deleted: (holding w) (clear n)
   added: (clear w) (handempty) (on w n)
   goals met: 19 of 24
113. (unstack l t)
   deleted: (clear l) (handempty) (on l t)
   added: (holding l) (clear t)
   goals met: 18 of 24
114. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 18 of 24
115. (pick-up t)
   deleted: (ontable t) (clear t) (handempty)
   added: (holding t)
   goals met: 18 of 24
116. (stack t w)
   deleted: (holding t) (clear w)
   added: (clear t) (handempty) (on t w)
   goals met: 19 of 24
117. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 19 of 24
118. (stack l t)
   deleted: (holding l) (clear t)
   added: (clear l) (handempty) (on l t)
   goals met: 20 of 24
119. (unstack e v)
   deleted: (clear e) (handempty) (on e v)
   added: (holding e) (clear v)
   goals met: 19 of 24
120. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 19 of 24
121. (unstack v f)
   deleted: (clear v) (handempty) (on v f)
   added: (holding v) (clear f)
   goals met: 18 of 24
122. (put-down v)
   deleted: (holding v)
   added: (clear v) (handempty) (ontable v)
   goals met: 18 of 24
123. (unstack f i)
   deleted: (clear f) (handempty) (on f i)
   added: (holding f) (clear i)
   goals met: 17 of 24
124. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 17 of 24
125. (pick-up i)
   deleted: (ontable i) (clear i) (handempty)
   added: (holding i)
   goals met: 17 of 24
126. (stack i q)
   deleted: (holding i) (clear q)
   added: (clear i) (handempty) (on i q)
   goals met: 18 of 24
127. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 18 of 24
128. (stack f i)
   deleted: (holding f) (clear i)
   added: (clear f) (handempty) (on f i)
   goals met: 19 of 24
129. (pick-up v)
   deleted: (ontable v) (clear v) (handempty)
   added: (holding v)
   goals met: 19 of 24
130. (stack v f)
   deleted: (holding v) (clear f)
   added: (clear v) (handempty) (on v f)
   goals met: 20 of 24
131. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 20 of 24
132. (stack e v)
   deleted: (holding e) (clear v)
   added: (clear e) (handempty) (on e v)
   goals met: 21 of 24
133. (unstack b k)
   deleted: (clear b) (handempty) (on b k)
   added: (holding b) (clear k)
   goals met: 20 of 24
134. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 20 of 24
135. (unstack k p)
   deleted: (clear k) (handempty) (on k p)
   added: (holding k) (clear p)
   goals met: 19 of 24
136. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 19 of 24
137. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 19 of 24
138. (stack b k)
   deleted: (holding b) (clear k)
   added: (clear b) (handempty) (on b k)
   goals met: 20 of 24
139. (unstack p m)
   deleted: (clear p) (handempty) (on p m)
   added: (holding p) (clear m)
   goals met: 19 of 24
140. (stack p b)
   deleted: (holding p) (clear b)
   added: (clear p) (handempty) (on p b)
   goals met: 19 of 24
141. (unstack m x)
   deleted: (clear m) (handempty) (on m x)
   added: (holding m) (clear x)
   goals met: 18 of 24
142. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 18 of 24
143. (pick-up x)
   deleted: (ontable x) (clear x) (handempty)
   added: (holding x)
   goals met: 18 of 24
144. (stack x e)
   deleted: (holding x) (clear e)
   added: (clear x) (handempty) (on x e)
   goals met: 19 of 24
145. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 19 of 24
146. (stack m x)
   deleted: (holding m) (clear x)
   added: (clear m) (handempty) (on m x)
   goals met: 20 of 24
147. (unstack p b)
   deleted: (clear p) (handempty) (on p b)
   added: (holding p) (clear b)
   goals met: 20 of 24
148. (stack p m)
   deleted: (holding p) (clear m)
   added: (clear p) (handempty) (on p m)
   goals met: 21 of 24
149. (unstack b k)
   deleted: (clear b) (handempty) (on b k)
   added: (holding b) (clear k)
   goals met: 20 of 24
150. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 20 of 24
151. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 20 of 24
152. (stack k p)
   deleted: (holding k) (clear p)
   added: (clear k) (handempty) (on k p)
   goals met: 21 of 24
153. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 21 of 24
154. (stack b k)
   deleted: (holding b) (clear k)
   added: (clear b) (handempty) (on b k)
   goals met: 22 of 24
155. (unstack r c)
   deleted: (clear r) (handempty) (on r c)
   added: (holding r) (clear c)
   goals met: 21 of 24
156. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 21 of 24
157. (unstack c g)
   deleted: (clear c) (handempty) (on c g)
   added: (holding c) (clear g)
   goals met: 20 of 24
158. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 20 of 24
159. (unstack g j)
   deleted: (clear g) (handempty) (on g j)
   added: (holding g) (clear j)
   goals met: 19 of 24
160. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 19 of 24
161. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 19 of 24
162. (stack c g)
   deleted: (holding c) (clear g)
   added: (clear c) (handempty) (on c g)
   goals met: 20 of 24
163. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 20 of 24
164. (stack r c)
   deleted: (holding r) (clear c)
   added: (clear r) (handempty) (on r c)
   goals met: 21 of 24
165. (unstack j d)
   deleted: (clear j) (handempty) (on j d)
   added: (holding j) (clear d)
   goals met: 20 of 24
166. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 20 of 24
167. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 20 of 24
168. (stack d b)
   deleted: (holding d) (clear b)
   added: (clear d) (handempty) (on d b)
   goals met: 21 of 24
169. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 21 of 24
170. (stack j d)
   deleted: (holding j) (clear d)
   added: (clear j) (handempty) (on j d)
   goals met: 22 of 24
171. (unstack r c)
   deleted: (clear r) (handempty) (on r c)
   added: (holding r) (clear c)
   goals met: 21 of 24
172. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 21 of 24
173. (unstack c g)
   deleted: (clear c) (handempty) (on c g)
   added: (holding c) (clear g)
   goals met: 20 of 24
174. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 20 of 24
175. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 20 of 24
176. (stack r c)
   deleted: (holding r) (clear c)
   added: (clear r) (handempty) (on r c)
   goals met: 21 of 24
177. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 21 of 24
178. (stack g j)
   deleted: (holding g) (clear j)
   added: (clear g) (handempty) (on g j)
   goals met: 22 of 24
179. (unstack r c)
   deleted: (clear r) (handempty) (on r c)
   added: (holding r) (clear c)
   goals met: 21 of 24
180. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 21 of 24
181. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 21 of 24
182. (stack c g)
   deleted: (holding c) (clear g)
   added: (clear c) (handempty) (on c g)
   goals met: 22 of 24
183. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 22 of 24
184. (stack r c)
   deleted: (holding r) (clear c)
   added: (clear r) (handempty) (on r c)
   goals met: 23 of 24
185. (unstack l t)
   deleted: (clear l) (handempty) (on l t)
   added: (holding l) (clear t)
   goals met: 22 of 24
186. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 22 of 24
187. (unstack t w)
   deleted: (clear t) (handempty) (on t w)
   added: (holding t) (clear w)
   goals met: 21 of 24
188. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 21 of 24
189. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 21 of 24
190. (stack l t)
   deleted: (holding l) (clear t)
   added: (clear l) (handempty) (on l t)
   goals met: 22 of 24
191. (unstack w n)
   deleted: (clear w) (handempty) (on w n)
   added: (holding w) (clear n)
   goals met: 21 of 24
192. (put-down w)
   deleted: (holding w)
   added: (clear w) (handempty) (ontable w)
   goals met: 21 of 24
193. (unstack n o)
   deleted: (clear n) (handempty) (on n o)
   added: (holding n) (clear o)
   goals met: 20 of 24
194. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 20 of 24
195. (pick-up w)
   deleted: (ontable w) (clear w) (handempty)
   added: (holding w)
   goals met: 20 of 24
196. (stack w n)
   deleted: (holding w) (clear n)
   added: (clear w) (handempty) (on w n)
   goals met: 21 of 24
197. (unstack l t)
   deleted: (clear l) (handempty) (on l t)
   added: (holding l) (clear t)
   goals met: 20 of 24
198. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 20 of 24
199. (pick-up t)
   deleted: (ontable t) (clear t) (handempty)
   added: (holding t)
   goals met: 20 of 24
200. (stack t w)
   deleted: (holding t) (clear w)
   added: (clear t) (handempty) (on t w)
   goals met: 21 of 24
201. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 21 of 24
202. (stack l t)
   deleted: (holding l) (clear t)
   added: (clear l) (handempty) (on l t)
   goals met: 22 of 24
203. (unstack o s)
   deleted: (clear o) (handempty) (on o s)
   added: (holding o) (clear s)
   goals met: 21 of 24
204. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 21 of 24
205. (unstack s y)
   deleted: (clear s) (handempty) (on s y)
   added: (holding s) (clear y)
   goals met: 20 of 24
206. (put-down s)
   deleted: (holding s)
   added: (clear s) (handempty) (ontable s)
   goals met: 20 of 24
207. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 20 of 24
208. (stack o s)
   deleted: (holding o) (clear s)
   added: (clear o) (handempty) (on o s)
   goals met: 21 of 24
209. (unstack y a)
   deleted: (clear y) (handempty) (on y a)
   added: (holding y) (clear a)
   goals met: 20 of 24
210. (put-down y)
   deleted: (holding y)
   added: (clear y) (handempty) (ontable y)
   goals met: 20 of 24
211. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 20 of 24
212. (stack a r)
   deleted: (holding a) (clear r)
   added: (clear a) (handempty) (on a r)
   goals met: 21 of 24
213. (pick-up y)
   deleted: (ontable y) (clear y) (handempty)
   added: (holding y)
   goals met: 21 of 24
214. (stack y a)
   deleted: (holding y) (clear a)
   added: (clear y) (handempty) (on y a)
   goals met: 22 of 24
215. (unstack o s)
   deleted: (clear o) (handempty) (on o s)
   added: (holding o) (clear s)
   goals met: 21 of 24
216. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 21 of 24
217. (pick-up s)
   deleted: (ontable s) (clear s) (handempty)
   added: (holding s)
   goals met: 21 of 24
218. (stack s y)
   deleted: (holding s) (clear y)
   added: (clear s) (handempty) (on s y)
   goals met: 22 of 24
219. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 22 of 24
220. (stack o s)
   deleted: (holding o) (clear s)
   added: (clear o) (handempty) (on o s)
   goals met: 23 of 24
221. (unstack l t)
   deleted: (clear l) (handempty) (on l t)
   added: (holding l) (clear t)
   goals met: 22 of 24
222. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 22 of 24
223. (unstack t w)
   deleted: (clear t) (handempty) (on t w)
   added: (holding t) (clear w)
   goals met: 21 of 24
224. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 21 of 24
225. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 21 of 24
226. (stack l t)
   deleted: (holding l) (clear t)
   added: (clear l) (handempty) (on l t)
   goals met: 22 of 24
227. (unstack w n)
   deleted: (clear w) (handempty) (on w n)
   added: (holding w) (clear n)
   goals met: 21 of 24
228. (put-down w)
   deleted: (holding w)
   added: (clear w) (handempty) (ontable w)
   goals met: 21 of 24
229. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 21 of 24
230. (stack n o)
   deleted: (holding n) (clear o)
   added: (clear n) (handempty) (on n o)
   goals met: 22 of 24
231. (pick-up w)
   deleted: (ontable w) (clear w) (handempty)
   added: (holding w)
   goals met: 22 of 24
232. (stack w n)
   deleted: (holding w) (clear n)
   added: (clear w) (handempty) (on w n)
   goals met: 23 of 24
233. (unstack l t)
   deleted: (clear l) (handempty) (on l t)
   added: (holding l) (clear t)
   goals met: 22 of 24
234. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 22 of 24
235. (pick-up t)
   deleted: (ontable t) (clear t) (handempty)
   added: (holding t)
   goals met: 22 of 24
236. (stack t w)
   deleted: (holding t) (clear w)
   added: (clear t) (handempty) (on t w)
   goals met: 23 of 24
237. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 23 of 24
238. (dead-end-stack l t)
   deleted: (holding l) (clear t)
   added: (clear l) (on l t)
   goals met: 24 of 24
